[
  {
    "id": 4,
    "title": "v12.60 patch notes",
    "date": 1590008400000,
    "body": "\nFortnite v12.60 went live this morning, May 20. This patch featured a few bug fixes and new features, but the major changes have likely yet to be revealed. Those who have already hopped into Fortnite know that there are some strange clouds circulating around The Agency.\n\nBefore we get to that, let’s take a look at what’s already changed. Here are the patch notes for v12.60.\n\n## Battle Royale\n\n-   **Party Royale**\n    -   Grappler and Jetpack added\n-   **Operation: Infiltration**\n    -   New Spy Games playlist, extract the intel case from enemy team or protect your case.\n-   Dragacorn Glider animation changed and added back to the game.\n-   Riot Control Baton Pickaxe fixed (was causing player footsteps to be inaudible).\n-   Fixed damage indicators pointing in the wrong direction.\n-   You can now change your skin and visit the Item Shop while spectating a friend.\n-   New HUD indication that shows nearby gunfire\n-   **PC Controller changes**\n    -   Epic have pledged to make some changes to aim assist after the FNCS finals, so we can expect that next week. In an email, they stated,  \n        “Controller tweaking, tuning, and investigation continues. We have some changes for next steps, but we don’t want to release right before the FNCS Invitational Finals.”\n\n## Creative\n\nEpic made several changes and fixes to Creative Mode in this patch. Some of the highlights include:\n\n-   Fixed an issue where players would be unable to push or pull items closer to them when placing them via the quickbar.\n-   Fixed an issue where Player Built Structures would turn invisible when cutting them with the phone tool and quickly switching to the pickaxe.\n-   Fixed an issue where prefabs placed with quick bar do not drop when Drops is turned on.\n-   Fixed an issue where some prefabs and galleries are larger than indicated by the preview\n-   Fixed an issue where the phone tool cut button copies when double-clicked.\n-   Fixed an issue where there is no audio feedback when placing a prefab or gallery from the quickbar.\n-   Fixed an issue where the cost preview amount is inconsistent with the actual amount of memory used in the Thermometer.\n\nYou can take a look at the full list of v12.60  [Creative Mode patch notes here.](https://www.epicgames.com/fortnite/en-US/news/what-s-new-in-creative---v12-60)  We’ll let you know if any major unannounced changes get discovered as players get their hands on the new patch."
  },
  {
    "id": 3,
    "title": "v12.50 patch notes",
    "date": 1588194000000,
    "body": "\n**Fortnite’s v12.50 Update is now live, introducing two major nerfs to aim assist and Heavy Sniper Rifles following complaints from fans and content creators.**\n\nAim assist has been a hot topic among players of the popular battle royale title for some time now, with many believing that it gave controller players an unfair advantage over players who use keyboard and mouse.\n\nAfter months of these complaints, Epic have finally moved to try and address the problems, and have also made some changes to the Heavy Sniper, a weapon that has become a major part of player’s loadouts throughout Season 2.\n\n## **Heavy Sniper nerf**\n\nThe only weapon to receive a major change this week is the Heavy Sniper, with Epic moving to reduce it’s incredible power as it becomes more than just a long-distance weapon in the game. Recently, players have been using it to blast through enemy builds, which is not an intended use of the gun.\n\nOn top of that, the Heavy Sniper often killed in one bullet, but in an email sent this morning, the developers confirmed that they had “retuned their effectiveness,” so they no longer wipe out enemies with full health and shields in a single blast.\n\n![](https://fortniteintel.com/wp-content/uploads/2018/08/Fortnite_patch-notes_v5-21_header-v5-21_BR05_Yellow_News-Featured_Heavy-Sniper-1920x1080-a52029a5389265fb71706b160bc5a323790d09b4-1024x576.jpg)\n\nThe Heavy Sniper has been nerfed in the 12.50 Update. Credit: Epic Games\n\n## **Aim assist nerfed**\n\nPerhaps the headline addition in v12.50, Epic Games have finally responded to weeks of complaints from mouse and keyboard players and reduced the effectiveness of aim assist for controller users.\n\nMany have strongly believed that aim assist’s ability to lock on to an enemy gave those who used the console peripheral an unfair advantage, so the game’s developers have revealed that they included a change that makes “240hz aim assist act like 60hz,” in a move that will “impact target acquisition.”\n\n## **New Modes: Party Royale & Operation: Payload**\n\nAlongside those major changes, Epic have also introduced two new modes to the game in the form of Party Royale and Operation: Payload.\n\nParty Royale is a safe space for players to chill out and play with friends, with weapons and materials turned off. What this will actually entail remains unknown, but Epic have announced that they will be testing the mode for the first time on Friday, May 1/2 at 6:00 PM (PST) / 9:00 PM (EST) / 2:00 AM (BST), so everyone can hop in and see for themselves.\n\nOn top of that, players will also be able to sink their teeth into Operation: Payload, a new LTM that will see players defend a moving objective and guide it across a specified area while another team attempts to halt their progress, much like Overwatch.\n\n## Bug Fixes\n\nOf course, no Fortnite patch is complete without some bug fixes, and Epic has revealed which issues have been addressed on their official  [Trello](https://trello.com/c/crDa0Bhh/1327-known-issues-addressed-by-v1250)  page.\n\n**General**\n\n-   Framerate and resolution drops in v12.41\n\n**Battle Royale**\n\n-   Local Challenges not appearing when entering a new area\n-   “Block damage with a Kingsman” Challenge not tracking progress\n\n**Save the World**\n\n-   Surround Pound’s heavy attack may not deal damage to husks\n-   Players may be swapped to their pickaxe when using an ability that’s on cooldown\n-   Stormking Onslaught Projectiles are not functioning correctly\n-   Players may become stuck in a previous Dungeons zone while their teammates are in the next one\n-   Psylocke’s Pickaxe does not swing properly\n\n**Mobile**\n\n-   Video playback disabled on Android\n-   Extra Build buttons display Wall icons\n-   Ping marker displays 0m\n\nFortnite’s v12.50 patch is now live and available to download on PC, Xbox One, PS4, Nintendo Switch, and mobile devices."
  },
  {
    "id": 2,
    "title": "v12.41 patch notes",
    "date": 1587502800000,
    "body": "\n**Fortnite v12.41 is live. Take a look at the unofficial patch notes, here.**\n\nThe Fortnite v12.41 content update was, largely, focused on adding the new Travis Scott items to the game. There were  [a ton of cosmetic leaks](https://fortniteintel.com/all-fortnite-skins-cosmetics-leaked-for-travis-scott-event/31402/)  for the event, including a few new skins, emotes, wraps, back bling, and more.\n\nAdvertisement\n\nThere are new changes that went live with the update, however, including the construction of the Astronomical stage and additions to the surrounding areas.\n\n![](https://pbs.twimg.com/media/EWHPysDWkAMrhdN?format=jpg&name=large)\n\nThe stage is currently under construction, which will complete in the next couple of days. We got a closer look at how the stage will look when it’s completed, however. Here’s the full stage from data miner  [@FortTory.](https://twitter.com/FortTory)\n\nThere were a couple of bug fixes with this update, as well, but nothing like we’re used to. Epic made a few adjustments to Battle Royale and Creative Mode. These were small bug fixes – we can expect more in the next patch.\n\n-   Midas’ Golden Touch appearing in low resolution on weapon Wraps.\n-   UI disappears if canceling Ready Up while spectating.\n-   Double-clicking item in the Chest tab may cause the game to crash. (Creative)\n-   Loading into “My Island” in Creative mode may cause Fortnite to freeze. (Mobile\n\n![](https://fortniteintel.com/wp-content/uploads/2020/04/Astronomical-2-1024x576.jpg)\n\nThat’s all we have, for now. Again, this was a small update and was mostly focused on adding the Astronomical files to the game.\n\nWe’ll keep you posted if the community finds any secret changes that Epic made to Fortnite. If not, we’ll see you in the presumed v12.50 update, next wee"
  },
  {
    "id": 1,
    "title": "v12.40 patch notes",
    "date": 1586984400000,
    "body": "**Take a look at what to expect when you drop into your first Fortnite match after v12.40. Here are all of the map changes.**\n\nFortnite Chapter 2 Season 2 is, thankfully, taking a different route than Season 1 did. There are map changes nearly every update, making the game feel fresh once again.\n\nBefore you hop in and explore what’s new, take a look at where you should be heading. There are some differences at The Agency, The Shark, and other small places around the map.\n\n## Shark Ghost Prison\n\nThe biggest changes came to The Shark. This is the first POI – outside of Deadpool’s Yacht takeover – that didn’t transition to a Shadow base following the challenges.\n\nThis shift all but confirms that the allegiances were predetermined. Skye seems to be the one character that would have gone to Shadow if our selections carried any weight.\n\n![](https://fortniteintel.com/wp-content/uploads/2020/04/shark-prison-1024x576.jpg)\n\nPlayers are still exploring the new POI and all that comes with it. Small details will likely be uncovered later in the week.\n\nOne of the most obvious details is that there’s a massive cell dedicated to one person. This is the kind of cell that you see in the movies – designated for a prisoner with enhanced abilities or one that is incredibly dangerous.\n\nWho is being held, here? One of the superheroes on Deadpools’ team? Midas? A character whom we have yet to meet? Popular theories have Midas leading Ghost, so it wouldn’t make sense for him to be in there. We’ll have to wait and see what happens.\n\n## The Agency\n\nThe Agency has gone through some subtle changes, as well. The hatches that appeared after the v12.30 update are now glowing, as you can see from the image above.\n\nAccording to a leak from @iFireMonkey, the Agency will transition from a Ghost POI to a Shadow POI. It will be interesting to see where Midas goes after this or if he changes sides as well. This remains to be confirmed, of course.\n\n![](https://pbs.twimg.com/media/EVoSQ7aU0AIzakE?format=jpg&name=medium)\n\n## Other changes\n\nThere are a few, smaller, changes around the Fortnite map. We have some lore-specific changes that will only apply to those who have been following some of the subtle storylines of the season.\n\nThe Chair Truck that has been traveling around the map for the duration of Chapter 2 has crashed. Unfortunately, its story may have ended.\n\nThere are a few similar changes to this, as well. The Pipeman now has a gold wrench to take with him on his journey and a previously-crashed car is being hauled to Lazy Lake.\n\nSpeaking of Lazy Lake, there’s a new building in this area. The No Sweat Insurance company has returned and set up shop at Lazy Lake. You can find their signs in other areas, as well, including Pleasant Park, Sweaty Sands, and Frenzy Farm.\n\nThe update is still young, so players are still discovering all of the changes around the map. We’ll keep you posted when we find out more about what v12.40 has brought us.*"
  }
]
