[
  {
    "id": 3,
    "title": "Patch 1.10",
    "date": "1602658322000",
    "body": "[You already know about our latest map, Icebox](https://playvalorant.com/en-us/news/game-updates/what-s-new-in-valorant-act-iii/). You’ve even stuck your head in the freezer to run scrims. Hopefully, you’ll be happy to learn we’ve weighed Unrated queue to favor getting Icebox (at least for the first part of this patch).\n\nCompetitive folks, you’ll have to hold on for at least two weeks before you can earn rank on Icebox. But right off the bat, you can benefit from preferred server select, tighter rank matchmaking, and working on your Act Rank Badge.\n\nDon’t sleep on these FFA Deathmatch improvements!\n\n[![Patch_1_10_Highlights.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/blta1044dd66aa6b395/5f8106519245d74a2063d3ff/Patch_Notes_Highlights_1_10_V3.jpg)](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/blta1044dd66aa6b395/5f8106519245d74a2063d3ff/Patch_Notes_Highlights_1_10_V3.jpg)\n\n### MAP UPDATES\n\n![icebox-banner.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltc196613b8bfbc35f/5f800c5ded21e20f1440b285/icebox-banner.jpg)\n\n#### NEW MAP: ICEBOX\n\n_Each Icebox site is a complex combat space that features plenty of cover and verticality. This map emphasizes skirmishes, sharp aim, and adaptive play. There’s also a zipline that amplifies the feeling of quick action and verticality._\n\n_As we’re releasing Icebox ahead of schedule, we are going to be releasing it in a “beta” state for at least two weeks. During this time, the map will be available to play in Unrated, Spike Rush, and Deathmatch modes. We’re going to continue to optimize the performance on the map as well as continue to fix any bugs that might appear._  **_If all goes well, Icebox will then become available for play in the Competitive queue on October 27th._**\n\n-   Early in the patch, players queuing for Unrated will more often get placed on Icebox\n-   Ascenders (Ropes) / Ziplines\n\n-   Acceleration adjusted to prevent sudden shifts in direction (_this was added last patch but wasn’t in the patch notes because well, you might start asking about ziplines_)\n-   Added weapon tagging when shot while on Ascenders\n-   _These changes are intended to make players that are using Ascenders and Ziplines less evasive during combat._\n\n  \n![ascent-banner.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/blt46082664924e8084/5ed88b55ff1cb239b9500bf6/ascent-banner.jpg)![bind-banner.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/blt708819ced7283507/5ed88b55444d25730a19e01b/bind-banner.jpg)\n\n#### ASCENT, BIND\n\n-   Vision Cones accuracy improved for Ascent, Bind\n\n-   Haven, Split may also be updated in this patch\n-   [Called out by reddit user sabocano](https://www.reddit.com/r/VALORANT/comments/ioybyx/vision_cones_are_broken_in_this_game_we_need_a_fix/)\n\n  \n\n### COMPETITIVE UPDATES\n\n_Competitive Act II will end with Patch 1.10 and roll into the start of Act III. This means progress towards your Act Rank for Act II will be saved and you'll be put back into placement matches for Act III. Let’s see how you stack up with the new content and changes in Act III.Good luck on the climb!_\n\n_Competitive players will receive their Act Rank Badge for Act II and can start making progress on their badge for Act III. The center of your Act Rank Badge is your ninth best ranked win, but you’ll also be able to see your highest rank achieved at the top of the badge.The badge displays only for Competitive games and is displayed on the player card in: Competitive lobbies, map load, in-game combat report, and End-of-Game: MVP._  [_This is a new system we are trying out, so we look forward to hearing your feedback_](https://playvalorant.com/en-us/news/dev/act-ii-ranks-and-competitive-changes/).\n\n—Ian Fielding, Senior Producer\n\n-   You can now select your preferred server(s), increasing the chance you will play on a server you want\n-   Rank disparity for parties capped at 3 tiers (from 6).\n\n-   _We have also tightened our competitive matchmaking to reduce skill disparity._\n\n-   Immortal+ ranked changes will only be impacted by winning and losing and the decisiveness of the game outcome (how many rounds won or lost by) and not factor individual performance into the calculation\n\n-   _We’ll be testing and monitoring this change in Act III for potential future implementation in all ranks._\n\n[**Editor’s Note**:  _Remember! Act III’s new map, Icebox, has been disabled for Competitive until the next patch to give us time to fix any bugs or issues that may arise before enabling it for ranked play._]\n\n  \n\n### MODE UPDATES\n\n#### DEATHMATCH\n\n-   Increased player count 10 >>> 14 players\n-   Updated spawning algorithm to encourage safer spawns\n\n-   _Now that we’ve fixed some tech on the backend, we can support up to 14 players without compromising on our commitment to 128 tick-rate servers. With 10 players, you’d sometimes have to run 10 or 15 seconds to even find a fight, which can really kill your flow. Sometimes you’d also spawn way too close to enemies. This was because we had to artificially increase spawn density because of the low player count. Now that the player count has increased, we’ve re-tuned our spawning algorithm to try and give more consistently safer spawns._\n\n-   Removed periodic location pulse, and you’ll now only receive a pulse right when you respawn\n\n-   _Now that there are 14 players on the map, the pulse feels completely unnecessary. We’re keeping a single pulse for players right when they respawn so that they can help get their bearings and find a quick fight without getting caught off guard._\n\n-   Increased match length, first to 40 kills (was 30), time limit upped to 9 minutes (was 6)\n\n-   _We felt like the match length was a little too short to get into a real groove, especially now with more players, so we’re bumping the duration and kill limit up a bit._\n\n-   Kill Reloads: On every kill, players get an automatic, immediate full reload of their active weapon (Ares & Odin get 30 bullets back)\n\n-   _It already felt a little frustrating to have to reload in Deathmatch, and now that player count is higher, reloading feels like even more of a deathwish._\n\n-   XP gain increased from 500 to 900 XP\n\n-   _Honestly, 500 XP felt a little low for Deathmatch. We’re bumping this up to 900 to account for the increased match length with some extra on top._\n\n  \n\n### QUALITY OF LIFE\n\n-   Players now have the ability to choose their own Variant as opposed to having to level them sequentially\n-   The Battlepass now has upgrade Variants for the Surge skin line, including the free track Surge Sheriff\n-   Minimap performance increased\n-   Tournament mode enabled custom games can now fit up to 12 observers\n-   Requested guns can now be sold back to the shop, doing so will refund the player who fulfilled the request\n-   Observer can now hold walk when in freecam mode to reduce speed (fast and slow speed can be configured in settings menu)\n-   In-world pings are now team-colored for observers\n-   Reyna and Phoenix ult timers correctly update for observers\n-   The keybind text in the current spectate target widget has been removed for observers\n-   Flashed indicator for observers has been updated with new art\n-   Crosshair setting added that allows crosshair colors to be locked to team color for observers\n-   Players no longer get stuck trying to descend vent ropes while walking (leaving A-Tower)\n-   Added new modifier keybind for observers to jump straight to freecam when jumping to a player (left shift by default)\n-   Plant/defuse progress UI is now always visible to observers, and includes which player is taking the action\n-   Observer player no longer see player-specific hud indicators (e.g. taking damage indicator) when in freecam\n-   Ability timers now work for dead / spectating players & observers (e.g. reyna & phoenix ult durations)\n\n  \n\n### SOCIAL UPDATES\n\n-   Players will now be able to add and view friend notes. Notes from League of Legends will transfer over to VALORANT as well. Players will be able to edit these notes from VALORANT\n-   Social panel will now pause sorting for a short time while you’re interacting with it\n\n  \n\n### BUG FIXES\n\n-   Fixed a  **Shooting Range**  bug in the plant/defuse module in the shooting range where players couldn’t buy abilities\n-   Various  **Shooting Range**  UI bug fixes in the plant/defuse module, including incorrect text in the buy phase announcement, also adding a halfway tick to the defuse progress bar\n-   Fixed a bug where other players’ messages would be forcefully filtered out of chat after you sent a message\n-   Fixed a bug where the text box would not fade away in game"
  },
  {
    "id": 2,
    "title": "Patch 1.1",
    "date": 1591693200000,
    "body": "Surprise! Don’t lie, you didn’t think you’d get patch notes this week.\n\nThese are lighter, sure, but Patch 1.01 continues our effort to improve performance, this time focused on a smoother combat experience as well as additional support for high spec machines.\n\nOur new mode, Spike Rush, gets an injection of new Orb types to play with. For example, a Golden Gun Orb that lets you one-shot anybody with the quickness.\n\nAlso, Sage gets a nerf. Promise we’re not picking on healers.  \n\n![Patch_Notes_Highlights_101.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/blt96255e55d2e886f8/5edae3acbf4ae52c761ed27d/Patch_Notes_Highlights_101.jpg)\n\n**GAMEPLAY AND BALANCE**\n\n**SAGE**\n\n-   **Barrier Orb** cast range reduced 20 >>> 10 meters\n    -   _As a Sentinel, Sage is supposed to be most effective when defending territory that she already controls. The 20m cast range was allowing Sage to aggressively take control of neutral territory in a way that was inappropriate for her role in Valorant. This range reduction aims to keep her strong while defending territory but reduce her efficacy at taking ground._\n\n**MAP UPDATES**\n\n**Ascent**\n\n-   Fixed several spots where weapons were falling through the world and issues with wall penetration\n\n**All Maps**\n\n-   Modified several call out names to better match player terms\n\n**SPIKE RUSH UPDATE**\n\n-   Each game of Spike Rush now features a set of 5 randomly selected orbs\n    -   The Full Ultimate orb will always be available\n    -   4 of the remaining 7 orb types will be chosen at random\n-   Chosen orb types will be shown in a description widget both in character select and during pre-round\n\n**New Orb Types**\n\n-   Health Orb - Grants teamwide health regen (instant)\n    -   20 second duration\n    -   12 HP per second (3HP per tick)\n    -   SFX/VFX only play while actually healing\n\n-   Deception Orb - Applies “Paranoia” to the enemy team 3 seconds after capture\n    -   10 second debuff\n    -   Vision is greatly reduced (and a small Field of Vision shift)\n    -   Fake footsteps and gunfire play for affected players\n    -   Minimap is disabled\n\n-   Golden Gun - Grants capturing player a Golden Gun\n    -   One-shot, one-kill\n    -   Perfectly accurate at all times\n    -   Agent moves at knife speed\n    -   Only has a single bullet in chamber and 2 backup rounds\n    -   Kills grant an additional round\n\n**Misc.**\n\n-   New pre-round HUD element that shows the weapon & potential orb types for the current round.\n-   Players now get 1 ultimate point for collecting any orb.\n\n**PERFORMANCE UPDATES**\n\nOur performance work this patch primarily focuses on improving performance during combat and general performance improvements for high spec machines. The game should feel even smoother in combat and many scenes will likely have higher average FPS depending on your spec.\n\n-   **Combat Perf :**  We were able to fix a number of things causing dips during combat.\n    -   Skins for 9/10 players were failing to pre-load in the game. The first time you’d come across these skin in-game you’d experience a drop in framerate.\n    -   Reduced frame dips that would occur when a kill callout was added or removed to the hud.\n    -   Improved the performance of the  **Viper** specific HUD elements which had some performance issues.\n\n-   **+FPS on Mid to High Spec :**  We were able to improve CPU bottlenecks in a few places across the code as well. Lower spec machines may still benefit from some of these improvements but would only see the gains during combat.\n    -   Added multithreaded rendering support for high end machines. If your machine meets the requirements to benefit from multithreaded rendering, you'll see a new option to turn it on or off in the Graphics Quality menu. It's on by default for these machines\n    -   Multithreaded rendering improves performance in scenes where the cost of managing objects that need to be rendered exceeds the cost of the game simulation and the cost of actually rendering the scene on the GPU. These conditions most commonly occur when moving through scenes with lots of objects visible (ex. Split attacker spawn) and in cases where the game simulation doesn't require much work (ex. practice range, out of combat gameplay, etc.).\n\n-   Multithreaded vision cones; minimap vision cones will now compute on another thread, if it's able to\n-   Large VFX passes across all maps, this reduced the CPU side cost of these particles by allowing the GPU to do more of the simulation\n-   Reworked client performance Stats to include more detailed breakdown of frame times\n\n**QUALITY OF LIFE**\n\n-   Sova's Recon Dart will behave more consistently and only reveal the portion of enemies behind a wall\n-   Added a setting that allows the inventory to always appear\n-   Pings will no longer draw over allies and enemies when placed behind them\n-   Transition out of game now shows the map you just played instead of Brimstone and Sage walking into a teleporter\n-   In the shooting range, changing character now uses a lightweight and more performant UI than the flow going into a match\n-   Missions on the end of game screen are now sorted by completion and by type\n-   Minor visual improvements to Contract and Battlepass rewards in the progression widget located at the top of the screen\n\n**BUG FIXES**\n\n-   Fixed issue where translucent particles, like smoke layers, would show through  **Reyna’s** Nearsight.\n-   Fixed VFX that obscured  **Reyna’s** screen if she scoped while healing\n-   **Reyna’s** overheal health no longer incorrectly shows 151 total when maxed\n-   **Cypher** Spycameras placed on the teleporter door frames on Bind no longer teleport it’s view location underground\n-   **Cypher’s** Cyber Cage no longer holds the teleporter doors on Bind open\n-   The Area-of-Effect indicators for  **Sova’s** Recon Bolt and  **Reyna’s** Leer now only show up on the enemy’s minimap if the player or their allies are close to the affected area\n-   Fixed input and other various pieces of Agent control UI showing up for spectators\n-   Fixed a bug where dead player's 1st-person arms would appear to be floating in the air\n-   Fixed a bug where activating a spray could exit ADS while firing\n-   Fixed a bug with the Bullet Tracers setting, having this setting active used to also disable muzzle flash on some weapons in addition to tracers\n-   Fixed an issue with the mouse cursor flickering when moving it over the scoreboard\n-   Fixed an issue with milliseconds in the round timer not being accurate\n-   Fixed an issue with some keybindings not displaying keybinding conflicts warnings correctly\n-   Fixed an Observer bug where the first person being observed in the game did not have a character portrait\n-   Fixed an issue with automatic weapons rarely not displaying tracers or audio effects when fired in short bursts\n-   Fixed a bug where the defuse bar was duplicated\n-   Fixed voice input/output devices and settings not persisting across sessions\n-   Fixed a slew of localization issues across end of game screens\n-   Fixed a handful of visual issues across end of game screens\n-   Fixed an issue whispering players of the same name/general DM improvements\n-   Improved chat service error messaging\n-   Settings menu is now letterboxed as intended\n-   While on the Agents page, clicking on COLLECTION now correctly navigates back to the Arsenal page"
  },
  {
    "id": 1,
    "title": "Patch 1.0",
    "date": 1591088400000,
    "body": "If you’re reading this, it’s too late—VALORANT is launching.\n\nWhat’s new? Reyna is the latest Agent to join VALORANT—straight from the heart of Mexico. Ascent, an open playground for small wars of position and attrition, enters the map pool. Spike Rush (beta) also arrives to deliver a fresh and more hectic flavor of VALORANT.\n\nSage, Omen, Phoenix, Raze and Jett all received a decent share of buffs and nerfs respectively to get them ready for launch. This patch also targeted the framerate drops some of you were getting during combat. The devil’s in the details, but know that getting performance where we want for all players is an ongoing process we hope to nail down in the next few patches.\n\nImprovements to hit registration, and a rework of Split’s mid chokepoint joins the healthy list of fixes and updates below.\n\nGood game, mad patch notes.\n\n[![VAL_patchnotes1_graphic.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltfc1d3bdf04827755/5ed1ca694d187c101f3f3162/VAL_patchnotes1_graphic.jpg)](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltfc1d3bdf04827755/5ed1ca694d187c101f3f3162/VAL_patchnotes1_graphic.jpg)\n\n## **GAMEPLAY AND BALANCE**\n\n### **AGENT UPDATES**\n\n#### **SAGE**\n\n-   **Healing Orb** cooldown increased 35 >>> 45 seconds\n    -   _We like how much Sage is able to heal in a single heal, but felt she was able to use it too frequently during a round._\n-   **Barrier Orb** segment health reduced 1000 >>> 800\n-   **Barrier Orb**  duration reduced 40 >>> 30 seconds\n-   Friendly  **Barrier Orb**  walls now show on the minimap\n    -   _Previous changes to Sage’s Barrier Orb helped give it more counterplay options in pistol/early round but it’s still having too much impact in any given round. Our hope is that the wall stays a powerful stalling tool, but asks you to think more about when in the round you want to use it._\n\n#### **RAZE**\n\n-   **Blast Pack** maximum damage radius reduced 2 >>> 1 meters\n    -   _The Blast Pack has proven to be quite strong, especially when chained back-to-back. By reducing the inner maximum damage radius, we hope to reduce the average damage output of this ability while still keeping it powerful._\n\n#### **JETT**\n\n-   **Cloud Burst** smoke duration increased 4 >>> 7 seconds\n    -   _We feel like Jett has a strong, irreplaceable value in terms of her ability to deny trades. But we think her team-oriented output is a little too low. This should give her and her team a little more time to work off of her smokes._\n-   **Tailwind** automatically breaks Cypher’s Trapwires after being briefly revealed\n    -   _Tailwind force is powerful enough that Jett should easily be able to break free of any leash. This should allow her a little more freedom to make that aggressive, but risky play that creates space for her team._\n\n#### **PHOENIX**\n\n-   **Blaze**  duration increased 6 >>> 8 seconds\n    -   _We felt like the short wall duration, combined with the long cast time and short range, was forcing Phoenix to play a little too predictably around his wall. We’re bumping this up slightly to give him some more time to work with._\n-   **Blaze** damage: 15 every 0.25s >>> 1 every 0.033 seconds\n-   **Blaze** healing: 3 every 0.25s >>> 1 every 0.16 seconds\n    -   _These Damage over Time/Healing over Time models are updated to match the recent changes to our other DoT abilities. Additionally, we’ve matched the damage/healing values to be half as effective as Hot Hands, primarily so that the total healing output of these two abilities is at parity (50 health each). We’re also doing this so that Blaze doesn’t become the de-facto “healing” ability compared to Hot Hands._\n-   **Hot Hands** healing: 3 every 0.25s >>> 1 every 0.08s.\n    -   _Updated the HoT model to match recent changes to the DoT abilities._\n-   **Curveball** max flash duration increased 0.8 >>> 1.1 second\n    -   _The flash duration is short given how quickly he can get his curveball out on an enemy caught out of position. Even still, it was a hair too short, especially to justify the new 200 credit price point._\n-   **Run it Back** automatically reloads all weapons on respawn\n    -   _This is closer to a quality of life improvement. Phoenix’s ult often puts him in a position to empty his clips right before getting sent back. It was very jarring for a Phoenix player to wait several seconds to respawn, only to then have to spend another second reloading—potentially under pressure. We think the several second respawn time is enough time to justify an automatic reload._\n\n#### **OMEN**\n\n-   **Paranoia** is now equipped instead of quickcast, and hit detection improved, especially at close range\n    -   _Changed the cast paradigm to reward more proactive use of Paranoia over its previous reactive use case. Enemies will receive a warning when the projectile is fired rather than being in the direct path of it. This should make it hit enemies more reliably.'_\n-   **Dark Cover,** Omen now enters a “phaser” world where he can see through walls to place his smokes and pressing RELOAD toggles between phased and normal targeting.\n    -   _We wanted to provide Omen with a more precise way to place his smokes, especially when verticality is at play. We’ve provided a toggle back to the old view mode as well to make sure we still support the quick, close range smoke playstyle many Omen players have honed._\n-   **Dark Cover**  controls have been updated where Omen can now increase smoke distance with PRIMARY FIRE, decrease it with SECONDARY FIRE, and throw smoke with the ABILITY KEY.\n    -   _Yeah, this might be a difficult control shift for players who main Omen, but in the long run—and for new players—we think it’s more intuitive for the distance to be controlled by one hand on the mouse by default._\n-   **Shrouded Step,** Omen can now see his teleport location on the map and receives an in-world indicator of where he’s targeting when his vision of the point is obstructed.\n    -   _We want to help Omen understand where he is targeting his teleport, especially when he’s teleporting from out of his smoke._\n-   **From the Shadow,** Omen can now cancel his teleport while in Shade form by pressing the ABILITY KEY again—Omen still loses all of his ult points if he cancels.\n    -   _We want Omen to attempt plays and create fear for his opponents with his ultimate. Previously, the punishment for using the ult was almost certain death if caught by an enemy, and it pushed the ability into more niche use. Allowing Omen to cancel his ult if he’s in danger at the cost of his ult points will hopefully open more possibilities and value, while still pushing him to try and pick the best teleport spots possible._\n\n#### **SOUND VISUALIZATION (AUDIO ATTENUATION)**\n\n-   We’ve brought in more sounds made by Agents under the category of sounds that display their audio distance on the mini-map via the white circle. This includes ability sounds, reloads, spike interactions and more.\n    -   _Why? We wanted to provide players with the ability to understand when their noise can be heard by enemies and give them an idea of how far the sounds can be heard._\n\n----------\n\n## **MAP UPDATES**\n\n### **INTRODUCING A NEW MAP: ASCENT**\n\n-   Ascent is a map set in Italy that features a large, open middle area that both teams can skirmish over. Mid is a playground for diverse ability use and successfully controlling the area opens additional routes for Attackers to both Spike sites.\n-   As our new map for launch, Ascent will be slightly more common in our Matchmaking rotation for the first few days so that you can get more opportunities to play on the map.\n\n### **SPLIT**\n\n-   Restructured mid chokepoint\n    -   _We felt like Defenders were able to effectively plug up the main choke point in mid for a large percentage of the round. The new layout hopes to alleviate this issue. These changes open up the space quite a bit and provides an additional path to get around stalling abilities on the stairs. It also gives Attackers a few different angles to help siege B Tower and Vents._\n\n[![Old-mid.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltaee8a6ec8c5e2603/5ed00fd6859dd01a626892a8/Old-mid.jpg)](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltaee8a6ec8c5e2603/5ed00fd6859dd01a626892a8/Old-mid.jpg)\n\nOld\n\n[![New-mid.jpg](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltc81450142909c658/5ed00fd7d94d9d1a6948ed8f/New-mid.jpg)](https://images.contentstack.io/v3/assets/bltb6530b271fddd0b1/bltc81450142909c658/5ed00fd7d94d9d1a6948ed8f/New-mid.jpg)\n\nNew\n\n-   The train station maintenance crew was able to replace the burned out speaker system\n-   A certain frog’s head is now a little warmer\n\n### **HAVEN/BIND/SPLIT/ASCENT**\n\n-   Expanded our new system that combats map exploits to all other maps—this will eradicate anyone trying to escape the playspace\n-   Continued to fix level collision in order to enhance the smoothness of the gameplay space\n-   Completed draw call optimizations\n-   Also continued to block spots for Cypher’s Spycam that prevented counter-play; as always, huge thanks to  **everyone** who helps us find these!\n\n----------\n\n## **COMPETITIVE MODE UPDATE**\n\n-   Competitive mode will not be on at launch\n-   Similar to our closed beta launch, our initial focus is making sure our service is stable before activating competitive matchmaking. This is also a way to give new players the same courtesy that closed beta players had to learn the game ahead of turning on Competitive. We’ll also make some adjustments to Competitive based on remaining closed beta player feedback. Our plan is to turn on Competitive a few patches into our launch.\n\n----------\n\n## **PERFORMANCE UPDATES**\n\nThe team rallied in this patch to fix a number of performance issues. Our focus for this round is primarily on the framerate dips you may sometimes experience in combat. Simpler scenarios, where very little is happening, may not see the same dramatic gains in FPS. Rest assured, we’re not done improving performance and you can expect to see more from us on this subject in upcoming patches.\n\n-   **Combat Performance:** Addressed multiple causes of framerate dips in combat. These improvements should help the game feel smoother, especially in combat situations on higher-end PCs.\n    -   Effect pooling added for impacts, gunshots and footsteps. This should reduce frame drops when these events occur.\n    -   Disabled bullet casings from calculating physics + audio bounces. We’re looking to bring a more optimized version of this feature back in a future patch.\n    -   Reduce cost of z-pings and death pings by 10x\n    -   Fixed bug causing 90 raycasts per second when pinging\n    -   Fixed a bug where NOT opening the options menu every game would cause framerate to drop on a regular cadence\n-   **+FPS for mid to high specs:** Sped up calculations on the CPU for game and render threads. These improvements will be felt the most on machines with powerful GPUs bottlenecked by their CPU speeds.\n    -   Optimized minimap for visible elements\n    -   Fixed bug where minimap would calculate twice per frame\n    -   Fixed bounding boxes on a variety of VFX, reducing the number of VFX updating at any given time\n    -   Reduce cost of updating transform on render thread\n    -   Reworked a variety of HUD elements that were previously built on a particularly slow component\n-   **+FPS for low to mid specs:** Content improvements that will primarily help low to mid tier specs when rendering the world.\n    -   Reduced draw calls on all maps\n    -   Removed non-gameplay impacting map particles on Low and Medium Detail Quality\n    -   Optimized First Person Shadows to no longer consider lights that do not impact final shadows\n    -   Removed unintentionally large textures across gun buddies, scopes, silencers\n    -   Optimized VFX for Characters\n        -   Omen : ALL ABILITIES\n        -   Sage : ALL ABILITIES\n        -   Viper: ALL ABILITIES\n-   Closed exploit where Nvidia Inspector could be used to see through Viper and Phoenix wall abilities\n-   Added a setting for speaker configuration\n-   Additional tooltip clarity around what graphics quality settings actually do\n-   GPU Time stat now correctly excludes idle time\n\n----------\n\n## **QUALITY OF LIFE**\n\n-   Dying to a non-enemy player will no longer grant ultimate points. This includes dying to the spike, fall damage, a teammate’s ability, or your own ability.\n    -   _Context: This should eliminate some of the weird optimization around farming ultimate points when a death doesn’t have enough economic impact (e.g., self-killing at the end of the pistol round, or team kill at the start of a save round. We’ll continue to monitor to see if we need to further dissuade these “save round self-kills.”_\n-   Added VALORANT Community Code pop-up for new players\n-   Added chat and voice restrictions for repeat offenders of our Community Code\n    -   Chat and Voice restrictions last 72 hours\n    -   Getting a restriction will require you to log out. _Please take a moment to cool down and reflect before logging back in to play VALORANT :)_\n    -   Chat restrictions will be enforced for ‘all’ and ‘team’ chat, but your ‘party’ chat will still be available.\n    -   Voice restrictions will be enforced for ‘team’ chat, but your ‘party’ voice will still be available.\n-   Reporting categories updated to cover a wider range of Community Code violations\n-   Transition screens added before Character Select and In Game\n-   The button to upgrade a gun skin now indicates what type of improvement (variant, animation, etc.) will be granted by the upgrade\n-   Visual updates to collection and contract pages\n-   Adjusted ping calculation to be more accurate\n-   Added a setting to disable the spectator count widget on the HUD\n-   Updated the death camera to avoid obscuring the screen immediately after death\n-   Added a build version watermark\n-   Observer Updates\n    -   Added team-specific 1st-person fresnel highlighting for observers\n    -   Adjusted consistent coloring for Attackers/Defenders on the HUD\n    -   Attackers and Defenders don't swap in HUD on side swap rounds\n    -   Keybinds are consistent from round to round for swapping between players\n    -   Fixed scoreboard not showing the correct score\n-   Removed the 'freeze time' that would trigger when waiting for a player to reconnect at the start of the buy phase\n-   Updated shop icons\n\n----------\n\n## **HUD & UI**\n\n-   Added VFX to abilities, killfeed, and ceremonies (e.g., Ace or Clutch)\n-   Updated Spike visuals in the inventory\n-   Updated Armor icons in the shop\n-   Updated character portraits\n-   Added chat message regulation so that only send one chat message is sent when multiples of the same ping or VO command are used in rapid succession\n\n----------\n\n## **BUG FIXES: IN-GAME**\n\n-   \"Fixed a bug with “rewinding” for Hit Registration that could cause the client to slightly disagree with the server on where a target was when you pulled the trigger. This affected all players slightly, but scaled up in severity at lower FPS.\n-   Fixed an issue where client-side tracers desynced when yaw switching\n    -   _The server and client would sometimes disagree on where shots were landing when firing extended bursts._\n-   Fixed a bug that let you shred the gnar at supersonic speeds using  **Viper’s Toxic Screen**  as a projectile boost\n-   Fixed the ability to activate  **Viper’s Poison Cloud**  mid air if it has been picked up.\n-   Removed slow from  **Viper’s** Snakebite tooltip.\n-   **Cypher’s Spycam** now shows the direction it is looking right when it is possessed.\n-   Fixed more unintended  **Cypher Spycam** locations\n-   Fixed  **Sova’s** arrows sometimes unpredictably bouncing\n-   Fixed  **Sova** arrows from revealing through some walls\n-   Fixed a bug with  **Jett’s** lower body popping out of place during her glide—thanks physical therapy!\n-   Fixed an issue where blood was disabled\n-   Fixed an Observer bug where dead players appeared as Phoenix on the HUD when an entire team was dead\n-   Fixed a spectator issue where Cypher's tracers would appear inaccurate if the spectator swapped to him after he had entered/exited his camera\n-   Fixed an issue where a team could all disconnect on side swap rounds to surrender, but they would receive a win instead of a loss\n-   Fixed a bug that allowed Bucky's right click to penetrate through world geography\n-   Fixed a bug for the comms halo above a player's head, it should now activate with both Party chat and Team chat\n-   Fixed an issue where credits on the HUD appeared to be much higher than the 800 you receive on side swap rounds\n-   Fixed an issue with the scoreboard that would show enemy team above the credit cap\n-   Fixed a bug where players were fully movement inaccurate after being resurrected or respawning\n-   Fixed overruns on interactable objects like orbs or the Spike\n-   Fixed an issue where ally loadouts appeared to show damaged allies at full health\n-   Fixed issues with HUD prompts that would be cut off if the key to activate the prompt was bound to a key with more than one letter\n-   Fixed a bug where the buy phase announcement would always say to press B to buy, even if the key to open the Armory was bound to a different key\n-   Fixed an issue where reconnect messages would spam every round start\n-   Fixed an observer bug where text would overlap in the buy phase announcement\n-   Fixed an observer bug where some abilities were not appearing on the minimap properly\n-   Fixed a bug where the ping wheel on the megamap would not grey out when ping limited\n-   Fixed a bug in the Armory where weapon details would vanish after purchasing a weapon\n-   Fixed a bug where the Equip Last Equipped Weapon hotkey was not functioning properly after using an ability\n-   Fixed overlaps with instability indicators (i.e. High Ping) and the Spectator widget\n-   Fixed overlaps and overruns in the Combat Report\n-   Fixed an issue with dead player models occasionally flickering\n-   Fixed an issue with animations when aiming with the Odin for spectators\n-   Fixed flickering mouse cursor in a few places\n-   The tooltip pointing at Contracts can now be dismissed FOREVER\n-   Fixed a bug where half the Arsenal page would fade in when clicking on the Collection tab\n-   Fixed a bug where the personalized Store offers would blink before fading in\n-   Fixed a bug where various menus could overlap the lobby screen after a queue dodge\n\n----------\n\n## **BUG FIXES: GAME CLIENT**\n\n-   Fixed some visual bugs in the settings menus\n-   Fixed a bug with windowed mode where the VALORANT window would not save its location properly\n\n----------\n\n## **KNOWN ISSUES**\n\nWhile we’ve made good progress at addressing hit registration issues, there’s one known issue we haven’t gotten to yet:\n\n-   In very rare cases where a player has a lot of incoming packet loss, an enemy model may appear to be crouching when they’re actually standing (or vice versa). The connection has dropped the packet that says “this player un-crouched”, and there can be a short delay before it’s resent. We have a fix for this coming asap.\n\nWe’re also looking into ways to improve the visual clarity of our hit impact effects (especially sparks). In many of the clips that we reviewed, readability issues caused shoulder shots to read like headshots, further contributing to the feeling of hit reg being off.\n\n-   All impact effects (spark and blood) are pinned in world space where the hit was registered on the server. These show up after hearing back from the server, at which point the victim or attacker may have slightly shifted positions. Often, we've seen the target crouch into or move their head to where the hit impact renders.\n-   It’s difficult to read the exact hit location (center point) from the spark effect when compared to blood."
  }
]
