[
  {
    "id": 11,
    "title": "April 28TH, 2020",
    "date": 1588250408000,
    "body": "## PLAYLIST UPDATE\n### **Modern Warfare**\n\n*   Blueprint Gunfight\n*   Reinfected Ground War\n*   3v3 Cranked Gunfight\n*   Shoot the Ship 24/7 (includes Cranked and Grind!)\n\n### **Warzone**\n\n*   Solos, Trios, Quads\n*   Plunder Trios\n*   Most Wanted Contract – Instead of a random Operator being marked on your Tac Map, you are voluntarily putting a Bounty on yourself for any squad to see in Verdansk. Of course, this great risk does have some great rewards…\n\n## **DATA PACK DOWNLOAD:**\n\n**Own Modern Warfare on PS4 or Xbox?**\n\nToday’s update includes a required download for PlayStation and Xbox, about 15gbs, and is required to access Modern Warfare.\n\nOnce you install the patch and select a mode, (multiplayer, campaign, Special Operations, etc.), you will be brought to a game install menu. Here, you’ll need to download Data Pack 1 from this menu. Once the download is complete, you will need to hard close and reopen the game application.\n\nIf you run into any issues or need support, reach out to us [@ATVIAssist](https://twitter.com/atviassist)\n\n## **GENERAL FIXES:**\n\n*   Added a Challenges tab to the main multiplayer screen for easier access\n*   Adjusting how the audio is played for the Precision Airstrike so it follows the plane more precisely\n*   Fixed a bug where players using KBM in Game Battles could make custom weapon blueprints that could also be used in multiplayer or Warzone.\n*   Currently, white text will appear when someone is speaking, regardless of team. Now, when someone is on an enemy team, their text will appear red.\n*   Fix for an exploit on Hackney Yard while playing Infected\n*   Fixed a bug that would prevent players from being able to melee an enemy while on top of an ATV \n*   Various out of bounds and exploit fixes\n*   After the last update, Talon’s character model appeared stretched with graphical corruption issues while in the squad walk. This has been fixed\n*   Fix for some Season 3 emblems appearing with incorrect text\n*   Fixed an issue with Kreuger’s eyes while completing a finishing move\n*   Fixed a bug where some watches were appearing in the wrong direction when gesturing\n*   Fixed a bug where players could lose the option to pick their favorite Faction in the Operator menu\n*   Fixed a bug where white lighting could be seen while moving or firing a weapon near specific locations\n*   Added a gamepad-only _Deadzone _option that allows players to adjust the inner range in which stick input will not be registered.\n*   Fixed an issue that prevented Party members from editing their CDL Loadouts when the _CDL _Quick Play Filter was active.\n*   Fixed an issue where the _Auto Run_ feature would stop when players opened their in-game text chat.\n*   Fixed an issue that prevented players from zooming in/out on the Tac Map if _Jump _was bound on _Mouse Wheel Up/Down_.\n\n## **WEAPONS**:\n\n*   Fix for a bug where completing the completionist challenges for the SKS are unlocking the associated camos for the Renetti\n*   Fix for a bug where unlocking camos for the SKS was inconsistent with other camo challenges for marksman rifles\n*   Fixed a bug where the “Hard Wired” skin for Alex would appear in thermals while Cold Blooded is equipped\n\n## **WARZONE**:\n\n*   The ability to view available XP tokens is not visible in the Warzone Menu. This has been fixed.\n*   After being brought back into the match, a player was in a state where they couldn't interact with the team’s loadout drop, and they had the revive prompt on them even though they were alive. This has been fixed\n*   Adjusted the speed and sizing of the circle\n*   We’ve added the cargo truck back into BR Solos with reduced turning speed, acceleration, and top speed\n*   Moved the scoreboard to be visible in the pause menu\n*   Fix for an issue where the After-Action Report was not displaying the total team earnings\n*   Fixed a bug where players were unable to equip Armor Plates while Dead Silence is activated\n*   Added the ability to drop your currently equipped weapon from the backpack menu.\n*   New item – Armor Satchel – finding one of these allows you to carry up to 8 armor plates instead of 5.  These drop on death and can be looted by other players.  These do not contain any armor plates by default, only increase the player carry amount.  Guaranteed reward upon completing Scavenger contracts (replaces Gas Mask as the guaranteed item)\n    *   Gas mask will remain rare in loot and purchasable at the Buy Station.\n*   Plunder: Plunder Rating  \n\n    *   When you finish a match of plunder you’re now given a rating in the form of a coin. Bronze, Silver, Gold, Platinum and more! The more cash your team collected the cooler the coin. Get above 3.5 Million to find out the highest rating!\n\n## **SPECIAL OPERATIONS:**\n\n*   Fix for a bug where selecting the USEF 1 skin for the Mil-Sim Operator appears as the default skin in Co-op\n*   The Munitions Shop can now be accessed while in the safehouse at the beginning of each Special Operation.\n*   Operation Crosswind: Fixed various situations where players could get stuck outside of the plane when the rest of the team regroups.\n*   Fix some rare instances where players in last stand could be revived, or have started a self-revive, but still bleed out anyway.\n*   Fix an instance where the player's revive icon color could quickly shift from blue to red after they had been successfully revived.\n*   Fixed players being able to exit a Juggernaut suit, and then gain the ability to revive others even if they themselves were in last stand.\n*   Operation Harbinger – Players can now exit the safehouse earlier and ‘capture’ the first intel item faster following the dialog from Kamarov.\n*   Operation Harbinger - Fixed missing audio on the large cargo truck.\n*   Operation Crosswind - Fixed some instances of soldiers giving armored hitmarkers, but not having visible armor.\n*   Fixed an issue where a syringe could be seen floating while reviving a teammate.\n*   Fixed an issue with helicopter audio.\n\n## **PC:**\n\n*   Fix for a bug where players using a Vega64 GPU could see corrupted outlines around their character models and weapons.\n*   Fixed a crash that occurred to players using a GeForce 900 Series graphics card when they loaded the Crosswind Special Operations Mission."
  },
  {
    "id": 10,
    "title": "Patch Notes 1.19 - Season 3 Update",
    "date": 1586362108000,
    "body": "### GENERAL FIXES:\n\n-   Lowered the max amount of XP and score given for Decoy Grenade assists\n-   Backend fixes to help Memory Error 13-71 issues. If you’re still experiencing this error, please reach out to Activision Customer Support\n-   Fixed a bug where more than one dog would be present in the squad walk in the main multiplayer menu\n-   As an owner of a regiment, players could sometimes see an error when selecting another player in their regiment. This has been fixed\n-   Fixed an issue where players were unable to skip cutscenes in the campaign while using keyboard and mouse controls\n-   Fixed a bug where players were sometimes unable to see Clan Tags for other players in the Social Menu after restarting app, or going through a power cycle\n-   Fixed an issue where some players could encounter graphical corruptions, causing their screen to have a black ‘shadow’ that followed them. This has been fixed\n-   Fix for an area on St. Petrograd that lacked collision and allowed the Recon Drone to fly out of bounds\n-   Fixed a bug that made clan tags appear twice\n-   Fixed a bug that could prevent players from speaking to their team in a custom match if they switched teams after the match has started\n\n### AUDIO:\n\n-   Lowered the volume of the plane audio during infil\n-   Lowered the audio once you enter the Gulag\n-   Reduced the volume of occluded far and distant weapons\n-   Some footstep sounds while ADS and crouched were cut short on the distance you could hear them, depending on the surface type\n\n### WEAPONS:\n\n-   Fixed an issue where “The Line Breaker” variant of the EBR could out perform the base version of the same weapon\n-   Players with the “Cherry Blossom” variant of the Akimbo handguns could have broken animations while ADS on ladders. This has been fixed\n-   Firing a smoke grenade with the under barrel 40mm smokescreen launcher did not emit any smoke from the grenade. This has been fixed\n-   Attaching the Sniper Scope to the MK2 Carbine while in the Gunsmith would show a white, opaque lens. This has been fixed.\n-   Tightened the pellet spread on the Slug 6-R Mags for the Model 680\n-   Akimbo weapons now start with 2 extra magazines of ammunition instead of 1\n-   Tightened up the hip spread on the VLK Rogue Shotgun\n-   Decreased ADS spread for shotgun slugs\n-   Added descriptions to slugs noting that longer barrels and chokes improve ADS accuracy\n-   Updating names of weapons to match weapon logos\n    -   725: “FTAC Equilibrium” renamed to “Cronen Equilibrium”\n    -   SA87: “FSS SA87 Heavy Stock Pro” renamed to “XRK SA87 Heavy Stock Pro”\n    -   RAM-7: “XRK Ranger” renamed to “FSS Ranger\n    -   Grau 5.56: “FSS 26.4″ Archangel” renamed to “Tempus 26.4″ Archangel”\n\n### SPECIAL OPERATIONS:\n\n-   Added on screen text to call out when a player’s vehicle is damaged\n-   Operation Headhunter: Fix for an error that could occur after launching the drone\n-   Operation Headhunter: Fixed a bug where the minimap could overlap the Objectives on screen\n-   Fall damage is now the same in Co-Op as it is in Warzone\n\n### WARZONE:\n\n-   We now tell you how far away you are from your teammates while in a match\n-   Fix for the gas mask animation interrupting and blocking players from deploying their parachute\n-   Various exploit fixes\n-   Fix for a bug where players were unable to revive teammates after getting interrupted during the initial revive animation\n-   Fixed a bug where players could be killed by vehicles without being near the player\n-   Fixed an issue that could display the incorrect rank on screen after the player’s game application had been suspended and reopened\n-   Fixed an issue where deploying a Recon Drone would use the VO lines for a Personal Radar. That VO was also heard by all players on the map. This has been fixed\n-   Fix for a bug where players could become invincible if they become downed while switching seats in a Tac Rover\n-   While spectating a player in the Gulag, the option to redeploy your teammate would appear on screen, even though they cannot be redeployed. This has been fixed\n-   If a player spectates the winning team of a BR match, the After-Action Report will display the winning team’s score in the scoreboard tab. This has been fixed.\n-   Fixed a bug where placing a Shield Turret on a teammate could kill them\n\n### PLUNDER:\n\n-   Fixed a bug where players couldn’t swap out the M13 for any other weapon in the Plunder tutorial\n\n### BATTLE ROYALE:\n\n-   Fix for players unable to self-revive in Solos\n-   Increased price of Loadout Drop within the Buy Station to $10,000\n-   Removed Blood Splatter and Screen Shake when being punched in the Gulag waiting area\n-   Removed Loss Column from BR Leaderboard and replaced with Top 10s\n-   Fixed issue with final circles occurring out of bounds or in undesirable areas\n-   Fixed issue with Armor plates and Killstreaks being unusable under certain conditions\n\n### PC:\n\n-   Several fixes to prevent crashes and improve stability\n\n\n\n\n\n"
  },
  {
    "id": 9,
    "title": "March 26, 2020",
    "date": 1585213200000,
    "body": "**WHAT'S NEW:**\n\n*   New Coalition Operator, Talon!\n*   Khandor Hideout 24/7 Playlist in Modern Warfare Multiplayer! \n*   NVG Infected Multiplayer Mode - Infected in the Dark. Survivors have a thermal sight and limited NVG battery, but the Infected can see in Dark. Realism damage, so make those headshots count! \n*   Plunder: Blood Money - Guaranteed cash drops on all kills. Bounty Contracts and Finishing Moves pay extra cash!\n\n**GENERAL FIXES:**\n\n*   When using a Tactical Insertion in the crawl space near the oil derrick on Rust, the player will spawn elsewhere on the map instead of where the Tac Insert was placed. This has been fixed\n*   When using KBM, the navigation arrows used to change which Season you’re viewing go in the wrong direction. This has been fixed\n*   Fixed a bug where the killcam showed the player they were killed by Thermite rather than underbarrel thermite\n*   In some cases, Xbox players might experience in-game stuttering after the console has been in Rest Mode and the “Instant On” setting is enabled. This has been fixed\n*   Fix for a bug where players could see Daily Challenges rewarding duplicate rewards instead of XP\n*   We now show weapon and equipment counts in the killcam. If a player was using Stopping Power, then the ammo count will be orange to denote this. We also show whether a player was using Dead Silence in the killcam as well\n*   Since the 3/10 update, some players could encounter white flashes of light/VFX when shooting/standing near a wall, object, or another player. This has been fixed\n\n**Weapons:**\n\n*   Increased the max travel time for Crossbow bolts from 3 seconds to 6 seconds for longer distance shots\n*   Bolt action rechamber will no longer be retriggered if interrupted after the round has been ejected (this fixes an issue with redundant bolt action rechambers after weapon switches)\n*   Removing inaccurate attachment description from Solozero NVG Enhanced Scope: “Optic glint visible to enemies”\n\n**Perks:**\n\n*   Amped: Increased Amped reload speeds for the Strela-P, PILA, and JOKR\n*   E.O.D: Damage resistance fixes and tuning:\n    *   Fixed an issue where Thermite equipment was not showing the damage resistance icon even though damage resistance was being applied\n    *   Stuck Thermite and Thermite bolts no longer have their damage reduced\n\n**Field Upgrades:**\n\n*   Field Upgrade Pro: Stopped cases where failed Field Upgrade placements would cause equipment to be used\n*   Tactical Insert: Added broken Tactical Insert icon that is shown when the Tac Insert is destroyed\n*   Deployable Cover**:**\n    *   Shotguns now destroy Deployable Cover with 3 melee hits\n    *   Added damage stats for vehicle and thermite damage\n    *   Fixed a bug where placing Deployable Cover on a door two times would allow the door to be moved\n*   EMP Drone: Allow the EMP Drone to be used at the start of a new round in multi-round game modes\n*   Stopping Power: We’ve doubled the amount of Stopping Power ammo given to Akimbo weapons\n\n**PC:**\n\n*   Stun Grenades are now less intense\n*   Several fixes to prevent crashes and improve stability\n\n**Campaign**: While on Embassy, at the Green Beam checkpoint, players would not be able to progress in the mission after using the drone strike. This has been fixed.\n\n**Special Operations**:\n\n*   Operation Strongbox: Fix for the vault location/crypto key objective markers not displaying on the Tac-Map\n*   Operation Strongbox: Fixed a bug that prevented guided rockets from locking onto the enemy helicopter\n*   Operation Brimstone: Fixed a bug where objective icons were not appearing on the Tac-Map\n*   Operation Crosswind: Fix for sometimes jumping out of the plane into an out of bounds area\n*   Operation Crosswind: Fix for enemies not spawning in the plane if one player is outside of the plane during the regroup\n*   Operation Headhunter: Fix for Cruise Missile marking teammates as enemy targets\n*   Operation Just Reward: Fix for stealth being automatically broken when retrying the Operation\n*   Operation Just Reward: Enemy sentries will no longer shoot players parachuting in\n*   Rebalanced explosive damage against Juggernauts\n*   Fix for a bug where the Double Time Perk was not awarding the correct speed bonuses\n*   Fixed a camera bug that could sometimes drift off the while in the pickup truck\n*   Fix for icons not appearing correctly when using UAV\n*   Fix for exploit involving molotovs and munitions crates\n*   Fix for High Alert not triggering on suicide bombers or juggernauts\n*   Fix for throwing knife not killing enemies in 1 hit\n*   Fix for players respawning with empty ammo clips/magazines\n*   Fix for enemy melee attacks ignoring player armor\n*   Fix for Restock perk not showing grenades recharging\n*   Fix for Suicide Bombers playing their VO too frequently\n\n**Ground War**\n\n*   Fix for a bug that resulted in a player falling through the map upon spawning on a tank as it became full\n\n**Warzone**:\n\n*   New weapons can be found on the ground and in Supply Boxes: 725 Shotgun, MK2 Carbine (Marksman Rifle),  EBR-14 (Marksman Rifle) and the .50 GS (Handgun)\n*   Players who disconnect in Last Stand will now drop their items when leaving the game\n*   Fix for a bug where the animation for the player equipping a gas mask will interrupt and block players from deploying their parachute\n*   Tuned close up shotgun damage to prevent a single shotgun blast from downing a fully armored player. Stopping power can still make this happen\n*   Added Warzone specific controller button layouts. The _Bumper Ping_ and _Bumper Ping Flipped_ layouts will allow those playing Warzone with a controller to use the Ping feature more efficiently\n\n**Plunder**:\n\n*   Players can no longer stack self-revive kits\n*   Players that are spectating still get plunder payouts from contracts but at only 40% of the value paid to living players\n*   Fixes to help prevent hitching when interacting with Cash Deposit Helicopters and Recon Contracts\n\n**Battle Royale:**\n\n*   Fix for a rare bug that allowed players to equip two riot shields if they had two different camos, but only one would appear on the player\n\n*   Made it easier to see which item is selected while using a Buy Station\n*   Updated button layout for equipment while using gamepad\n*   Fixed a bug for players are not receiving a banner on the top right of the screen for allies or enemies initiating kill streaks \n*   Prevent bullets that hit the riot-shield from depleting player armor\n*   If a player flies the Recon Drone out of bounds, the player will hear the out of bounds countdown timer but will not see the countdown splash on their screen. This has been fixed\n*   Fix for various and potential exploits\n*   Field Upgrades: Fixed a bug where some Field Upgrades were not ending at the end of the pre-match\n*   Players will now get a kill when someone that you’ve downed, disconnects from the game\n*   Reduced the amount of cash given for averting a bounty\n*   Increased price of Loadout Drop within the Buy Station to $8,500"
  },
  {
    "id": 8,
    "title": "March 17, 2020",
    "date": 1584435600000,
    "body": "**Multiplayer:**\n- Cranked Kill Confirmed\n- Mercenary Moshpit\n- Atlas Superstore 24/7 (10v10) “Doorbuster 24/7”\n- Gunfight is now St. Patrick’s Day themed!\n\n**Battle Royale:**\n- Solo Mode! That's right. Just you. \n\n**GENERAL FIXES:**\n- Fix for a rare bug where players could have increased movement speed after coming out of the Gulag and back into the game\n- Fixed a bug where players may find their weapon in a stowed position and are unable to reload or use their weapon\n- In some cases, players could become stuck under Buy Stations when prone. This has been fixed\n- The Threat UI could disappear from the screen if players complete a contract while they are being hunted from a Bounty Contract. This has been fixed\n- Updated text to “Redeploy Squadmate” to make it a little more obvious on screen when you can buy back a teammate\n- Fix for the last objective in the “Boats and Trains” Mission not tracking as intended\n- Kills are now credited to the player who downed the enemy player.\n- Fix for an exploit where players were able to shoot while downed\n- Fixed a bug where players were unable to deposit cash using balloons if their settings were set to “Contextual Tap”\n- Fixed a bug where players were able to clip into the walls in the Hospital "
  },
  {
    "id": 7,
    "title": "March 10, 2020",
    "date": 1583830800000,
    "body": "**PLAYLIST UPDATE:**\n- Added Search and Rescue\n- Added Mayhem Mosh Pit (10v10 Grind, Drop Zone, and Cranked)\n- Removing \"Boots on the Ground War\"\n\n**GENERAL FIXES:**\n- NEW Shotgun: \"VLK Rogue\"\n- Fixed a bug that prevented respawning after a Defcon Nuke had been set off in Realism Ground War\n- Increased damage to Juggernauts when being hit by a Thermite Crossbow\n- Various Exploit fixes, including fixes to Hackney Yard and Piccadilly\n- Fix for a bug where a different pistol than one that was equipped would appear when climbing a ladder\n- Fixed a bug where any charm used alongside the MP7 Bengal variant would clip through the weapon\n- Various Ground War exploit fixes\n- Fix for a bug where a constant yellow “High Alert” screen would persist after death if the player died while the perk was granted via Specialist\n- Fixed a bug in the After-Action Report that would display 0 in the Challenge field even if a Challenge had been completed\n- Fixed a bug that would spawn players elsewhere on the map after using a Tactical Insertion near the crawl space on Rust\n- Fixed a bug in the Giant Infection mode that spammed radio VO across all teammates when a player is a driver or passenger\n- Fixed a bug that allowed players to deploy throwable Field Upgrades during the round countdown. After the countdown ends, the player would still have another Field Upgrade available. This has been fixed\n- Added option to toggle a square or circular minimap\n\n**Call of Duty League:** Restricted the .357 Snake Shot in the CDL public playlist\n\n**Weapons:**\n- 725 Sawed-Off Barrel:\n    - Increased move speed\n    - Increased ADS Spread\n    - Reduced ADS damage\n    - Reduced far damage range\n    - Extended very lethal close damage range\n- Fix for the RAM-7 variant, “The Corrupter” not allowing the use of any sniper scopes\n- Fixed a bug that could create an 'infinite ammo' glitch on the Model 680\n- Updating the ammo descriptions to the “Bludgeoner” LMG and the “Skull Hammer” Shotgun\n- Fix for a bug where using an NVG Thermal Scope on the Grau 5.56 could cause a graphical bug\n\n**Missions and Challenges:**\n- Fix for a bug that only displayed the “One Shot One Kill” splash medal on screen when a sniper rifle was used. This is fixed to display whenever any one-shot weapon like shotguns or marksman rifles are used\n- Fix for the “Get 50 Kills with Light Machine Guns” challenge not tracking as intended\n- Fix for Golem’s 3rd Mission Objective, “Get 5 Kills using Lethal Equipment” not tracking properly\n- All vehicles now award progress to any challenges that require “X vehicle run over kills”\n- Updates to the splash screen and in-game HUD as players make progress in the “Alliance” Missions\n\n**Classic Special Operations:**\n- Fixed a bug that prevented players for being able to use finishing moves on enemy AI. This has been fixed\n- Bomb Squad: Fix for a bug there enemies might not spawn until after the last bomb is defused\n\n**Special Operations:** Survival - Leaderboards for Azhir Cave (night) and St. Petrograd have been added\n\n**Special Operations:**\n- Camera is now in a fixed position when reviving while prone or crouched\n- Hostages will reset to a safe area if dropped out of bounds\n- Fix match ending if the last-alive player calls in a Team Revive but goes down before the other players revive themselves.\n- Fix some instances where the juggernaut music could stay on unintentionally\n- Increase Heavy Hitter weapon perk to 2x melee damage\n- Ensure that players who are parachuting receive the ‘out of bounds’ warning if they drift out of bounds\n- Fix for hint prompts showing up while players are in last stand\n- Fix for an edge case that could prevent the 4th squad leader from spawning in during Operation Headhunter\n- Operation Just Reward: Fixed an issue where the cell phone intel would fail to drop\n- Operation Strongbox: Fixed a bug where destroying an enemy Wheelson was not granting any XP\n\n**Keyboard and Mouse:** a contextual menu is now displayed when KBM player right-click on usernames in the Social menu’s Party tab\n\n**PC:**\n- Several fixes to prevent crashes and improve stability\n- New PC players that are using the latest Battle.net client now have access to a simple, one-click way of creating their Activision account using their Battle.net credentials\n- Fixed a few cases where certain Social menu pop-up messages would display incorrectly in higher aspect ratios"
  },
  {
    "id": 1,
    "title": "February 26, 2020",
    "date": 1582707600000,
    "body": "**General Fixes:**\n* Players seeing a rank reset prompt screen after yesterday's update\n* Fixes for Regiment invites\n* Fix for the Quick Fix Perk not functioning as intended while used as a Specialist Perk\n* Fix for killstreaks still functioning in CDL playlists"
  },
  {
    "id": 2,
    "title": "February 19, 2020",
    "date": 1582102800000,
    "body": "**GENERAL FIXES:**\n* Fix for Regiment tags not appearing as intended\n* Fix for players receiving the \"Jockworth\" error while in Gunfight Tournaments\n* Fix for a bug where numbers on the team roster and numbers on the COD Caster minimap did not correspond\n* Pointman: Fix for an issue where Killchain scores were being given for killstreak kills without having Killchain equipped\n* Fix for a CDL Gunsmith exploit"
  },
  {
    "id": 3,
    "title": "February 14, 2020",
    "date": 1581670800000,
    "body": "**GENERAL FIXES**\n* Fix for a bug that allowed players to use attachments not yet earned\n* Exploit fixes on various maps and modes\n* Fixed a bug that leave a players CDL filter active after they've joined a party without CDL filters\n* Backend fixes"
  },
  {
    "id": 4,
    "title": "December 11, 2019",
    "date": 1576054800000,
    "body": "* **General Fixes**\n  - Fix for the R9-0 Smoothebore not appearing correctly in-game\n  - Fix for the \"Smooth Dominator\" not appearing correctly in-game\n  - Fix for the \"Heat Cycle\" weapon not appearing correctly in-game\n  - Fix for a bug where equipping the \"Old Wounds\" LMG could cause an error, kicking players out of the menu\n  - Operator challenge descriptions have been updated to indicate that a specific Operator must be equipped in order to complete the challenge\n  - If you reached a new rank while in the middle of a match and perform the criteria to complete a challenge you just unlocked, progress would not show in the UI until you entered a new match. We've done some backend work to help improve this.\n  - Fix for Objective 2 of Mara's Operator Mission showing a placeholder name 'Desert Work' for the reward\n  - Fix for Wyatt's Calling Card appearing with the incorrect rarity\n  - Fix for the Cluster Strike's missiles getting stuck on surfaces without detonating and playing looping audio the remainder of the match\n  - Fix for exploits in Special Operations: Survival"
  },
  {
    "id": 5,
    "title": "December 10, 2019",
    "date": 1575968400000,
    "body": "* **WHAT'S NEW:**\n  - Gunfight: OSP (replaces Gunfight)\n  - Infected (replaces Reinforce)\n  - New Ground War map, Aniyah Palace\n* **Hardcore Additions:**\n  - FFA\n  - NVG Moshpit (TDM, Kill Confirmed, Headquarters, Domination)\n  - Shoot House 24/7 (TDM, Kill Confirmed, Headquarters, Domination)"
  },
  {
    "id": 6,
    "title": "December 6, 2019",
    "date": 1575622800000,
    "body": "* WHAT'S NEW:\n  - Shoot House 24/7 is back! (replaces Crash 24/7)\n  - Removed night maps from Hardcore modes\n  - Added Docks back into Gunfight map rotation\n  - Added Grazna Raid and Arklov Peak to Hardcore TDM\n  - Added Arklov Peak to Hardcore Headquarters\n* GENERAL FIXES:\n  - When attempting to view weapon details of a weapon in the Missions tab, players will be kicked back to the main menu. This has been fixed.\n  - Fix for the cargo ship clipping through the playable area on Docks\n  - In some cases, players were not able to see or shoot down an opposing team's Counter UAV. This has been fixed\n  - Fix for the VTOL audio persisting after being shot down\n  - Fix for a crash that could occur while prone and firing the AK-47 with a launcher and the Fully Loaded perk equipped\n  - Fix for the \"Jack Frosty\" and \"Old Wounds\" world model appearing differently than the Armory/Gunsmith models\n  - Special Operations: \"Just Reward\" – Fix for the HVT truck crashing into portions of the map\n  - Special Operations: Survival – Fix for the respawn flare not working as intended"
  }
]
